In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'Name':['Sourav','Komal','Jatin','Anshu','Anurag','Simran'],
                  'Class':['btech','bca','mca','btech','mcom','mba'],
                  'Rolllno':[34,43,11,10,67,89]})
df

     Name  Class  Rolllno
0  Sourav  btech       34
1   Komal    bca       43
2   Jatin    mca       11
3   Anshu  btech       10
4  Anurag   mcom       67
5  Simran    mba       89

In [3]:
df.insert(2, column = 'marks', value = [34,33,32,28,43,44])
df

     Name  Class  marks  Rolllno
0  Sourav  btech     34       34
1   Komal    bca     33       43
2   Jatin    mca     32       11
3   Anshu  btech     28       10
4  Anurag   mcom     43       67
5  Simran    mba     44       89

In [4]:
df.columns

Index(['Name', 'Class', 'marks', 'Rolllno'], dtype='object')

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     6 non-null      object
 1   Class    6 non-null      object
 2   marks    6 non-null      int64
 3   Rolllno  6 non-null      int64
dtypes: int64(2), object(2)
memory usage: 324.0+ bytes

In [7]:
# iterrows
for i in df.iterrows():
    print(i)

(0, Name       Sourav
Class       btech
marks          34
Rolllno        34
Name: 0, dtype: object)
(1, Name       Komal
Class        bca
marks         33
Rolllno       43
Name: 1, dtype: object)
(2, Name       Jatin
Class        mca
marks         32
Rolllno       11
Name: 2, dtype: object)
(3, Name       Anshu
Class      btech
marks         28
Rolllno       10
Name: 3, dtype: object)
(4, Name       Anurag
Class        mcom
marks          43
Rolllno        67
Name: 4, dtype: object)
(5, Name       Simran
Class         mba
marks          44
Rolllno        89
Name: 5, dtype: object)

In [8]:
df1 = pd.DataFrame({'a':[1,2,3,4],'b':[4,3,2,1],'c':[3,7,8,5]})
df1

   a  b  c
0  1  4  3
1  2  3  7
2  3  2  8
3  4  1  5

In [9]:
df2 = pd.DataFrame({'a':[11,2,3,4],'b':[4,3,24,1],'c':[3,7,80,5]})
df2

    a   b   c
0  11   4   3
1   2   3   7
2   3  24  80
3   4   1   5

In [10]:
pd.concat((df1,df2))

    a   b   c
0   1   4   3
1   2   3   7
2   3   2   8
3   4   1   5
0  11   4   3
1   2   3   7
2   3  24  80
3   4   1   5

In [11]:
df3 = pd.DataFrame({'a':[11,2,3,4],'b':[4,3,24,1],'c':[3,7,80,5]})
df4 = pd.DataFrame({'a':[1,2,3,4],'b':[4,3,2,1],'e':[3,7,8,5]})
print(df3)
print(df4)

    a   b   c
0  11   4   3
1   2   3   7
2   3  24  80
3   4   1   5
   a  b  e
0  1  4  3
1  2  3  7
2  3  2  8
3  4  1  5

In [12]:
pd.concat((df3,df4), ignore_index = True)

    a   b     c    e
0  11   4   3.0  NaN
1   2   3   7.0  NaN
2   3  24  80.0  NaN
3   4   1   5.0  NaN
4   1   4   NaN  3.0
5   2   3   NaN  7.0
6   3   2   NaN  8.0
7   4   1   NaN  5.0

In [13]:
# axis=1-->columns, axis=0-->rows
pd.concat((df3,df4), axis=1)

    a   b   c  a  b  e
0  11   4   3  1  4  3
1   2   3   7  2  3  7
2   3  24  80  3  2  8
3   4   1   5  4  1  5

In [14]:
df

     Name  Class  marks  Rolllno
0  Sourav  btech     34       34
1   Komal    bca     33       43
2   Jatin    mca     32       11
3   Anshu  btech     28       10
4  Anurag   mcom     43       67
5  Simran    mba     44       89

In [18]:
df.sort_values(by = 'marks', ascending = False)

     Name  Class  marks  Rolllno
0  Simran    mba     44       89
1  Anurag   mcom     43       67
2  Sourav  btech     34       34
3   Komal    bca     33       43
4   Jatin    mca     32       11
5   Anshu  btech     28       10

In [16]:
df.sort_values(by = 'marks', ascending = False, ignore_index = True, inplace = True)

In [17]:
df

     Name  Class  marks  Rolllno
0  Simran    mba     44       89
1  Anurag   mcom     43       67
2  Sourav  btech     34       34
3   Komal    bca     33       43
4   Jatin    mca     32       11
5   Anshu  btech     28       10